{
    "tags": [
        {
            "id": "tag-id0",
            "name": "SCSS"
        },
        {
            "id": "tag-id1",
            "name": "JavaScript"
        },
        {
            "id": "tag-id2",
            "name": "language"
        },
        {
            "id": "tag-id3",
            "name": "HTML"
        },
        {
            "id": "tag-id4",
            "name": "React"
        },
        {
            "id": "tag-id5",
            "name": "CSS"
        }
    ],
    "notes": [
        {
            "id": "post-id1",
            "name": "Cascading Style Sheets (CSS)",
            "description": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup #language such as #HTML or XML (including XML dialects such as SVG, MathML or XHTML). #CSS is a cornerstone technology of the World Wide Web, alongside HTML and #JavaScript.",
            "tags": [
                "tag-id1",
                "tag-id2",
                "tag-id3",
                "tag-id5"
            ]
        },
        {
            "id": "post-id2",
            "name": "React",
            "description": "React (also known as React.js or ReactJS) is a free and open-source front-end #JavaScript library for building user interfaces based on components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies. #React can be used as a base in the development of single-page, mobile, or server-rendered applications with frameworks like Next.js. However, React is only concerned with the user interface and rendering components to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality.",
            "tags": [
                "tag-id4",
                "tag-id1"
            ]
        },
        {
            "id": "post-id3",
            "name": "Sass (stylesheet language)",
            "description": "Sass (short for syntactically awesome style sheets) is a preprocessor scripting #language that is interpreted or compiled into Cascading Style Sheets (CSS). SassScript is the scripting language itself. Sass consists of two syntaxes. The original syntax, called 'the indented syntax,' uses a syntax similar to Haml. It uses indentation to separate code blocks and newline characters to separate rules. The newer syntax, #SCSS (Sassy CSS), uses block formatting like that of #CSS. It uses braces to denote code blocks and semicolons to separate rules within a block. The indented syntax and SCSS files are traditionally given the extensions .sass and .scss, respectively.",
            "tags": [
                "tag-id5",
                "tag-id2",
                "tag-id0"
            ]
        },
        {
            "id": "post-id4",
            "name": "The HyperText Markup Language (HTML)",
            "description": "The HyperText Markup Language or HTML is the standard markup #language for documents designed to be displayed in a web browser. It is often assisted by technologies such as Cascading Style Sheets ( #CSS ) and scripting languages such as #JavaScript. Web browsers receive #HTML documents from a web server or from local storage and render the documents into multimedia web pages. HTML describes the structure of a web page semantically and originally included cues for its appearance.",
            "tags": [
                "tag-id1",
                "tag-id3",
                "tag-id5",
                "tag-id2"
            ]
        }
    ]
}